#include <reg51.h>
/**************************************************
接收数据中断服务子函数
***************************************************/
void RXD_CHAR() interrupt 4
{
    unsigned char RXD_data;
    if(RI==1) {                                //判断串行接收中断
        RXD_data = SBUF;        //读取数据
        P1 = RXD_data;                 //显示所读取的数据
        RI = 0;                                //接收完毕，清中断标志
    }                               
}
void main()
{
    TMOD = 0x20;                //将定时器1作为比特率的产生器
    TH1  = 0xFD;                //比特率设置为9600bit/s
    SCON = 0x50;                //串行工作模式为1,允许接收01010000                                  
    EA = 1;                                //开总中断
    ES = 1;                                //开串行中断
    TR1 = 1;                        //启动定时器1
   
        while(1) {
        ;        
    }
}